<template>
    <div>
      <div>
        <h2>会员注册</h2>
        <h3>描述：该功能为个人用户提供注册功能，同时采集用户信息，便于后续操作过程中的信息验证。</h3>
<!--        <textarea style="width: 100%;height: 100%;">-->
        <pre>
          1 用户需输入【手机号】【用户名】【密码】【确认密码】【短信验证码】，均为必填项，
          2 输入完成后点击下面的【注册】按钮，进入注册下一步操作，
          3 注册成功则跳转至登录页面，失败则在相应文本框中输出异常错误信息。
          4 在点击【获取短信验证码】按钮时，验证【手机号】是否已填写，【
          手机号】位数与格式是否正确.同时判断访客填写的手机号，
          若手机号已注册，无法获取短信验证码,并报错(手机号已注册)，
          5 点击注册时判断密码是否与确认密码相同，如果不同则在相应文本框中报错(两次输入密码不一致)。
          6 获取的验证码运用定时器进行计时处理，每一个验证码只有60秒有效时间，
          输入过期的验证码会在【验证码】文本框后显示“该验证码已失效”异常信息。
          7 用户名只能由中文字符、英文字符、数字进行注册。
        </pre>
<!--        </textarea>-->
        <h2>找回用户名、密码</h2>
        <h3>描述：该功能是给予已注册的用户的功能，用户忘记用户名或者密码、可以点击登录页的【找回用户名】、【找回密码】按钮进行操作。</h3>
        <pre>
          1 在登录页面下有【找回用户名】【找回密码】按钮，进入找回用户名、密码页面进行找回操作。
          2 使用手机号验证找回用户名，点击【找回用户名】按钮、
          进入页面输入手机号进行验证、验证成功则在相应文本框中输出用户名。
          3 找回密码可以用手机号验证方式找回，点击按钮【找回密码】进入页面、
          输入用户名手机号进行验证、还有输入密码和确认密码四个文本框，
          验证成功并且两次输入密码相同则成功修改用户密码、否则在相应文本框报错。
        </pre>
        <h2>登录</h2>
        <h3>描述：会员用户登录，可以使用用户名密码或手机号验证码进行登录操作。</h3>
        <pre>
          1 使用用户名密码登录：用户需输入【用户名】【密码】，均为必填项，点击登录时判断用户名密码是否正确，
          若全部输入正确，登入商城；若不正确。在相应文本框中报错。
          2 使用手机号验证登录：用户需输入【手机号】【短信码】，均为必填项，
          点击【获取短信验证码】按钮，后台请求http接口链接第三方接口给输入的手机号发送一个验证码，
          验证码使用定时器，规定在60秒后使该验证码变为无效验证，所以必须要在60内完成登录操作。
          点击登录时判断【手机号】与【短信验证码】是否匹配，若匹配，登入系统；若不匹配，则在相应文本框中报错
          3 功能流程：选择【登录】，页面跳转到商城登录页面；用户在登录界面录入用户名/手机号码和密码，
          点击【登录】按钮，即登录成功；点击【注册】可进入用户注册流程；
          点击【忘记用户名】可进入找回用户名流程；点击【忘记密码】可进入重置登录密码流程。
        </pre>
      </div>
    </div>
</template>

<script>
    export default {
        name: "newcourse"
    }
</script>

<style scoped>

</style>
